[
  {
    "title": "2 Top Artificial Intelligence (AI) Stocks to Buy No Matter What Happens With Tariffs",
    "abstract": "Key Points\nMeta Platforms has several long-term trends playing in its favor.\n\nNvidia's GPUs are starting to be produced in the U.S.\n\n10 stocks we like better than Meta Platforms ›\n\nArtificial intelligence (AI) investing is somewhat affected by tariffs, as tariffs may be placed on components coming into the U.S. In addition, broader consumer demand may harm some of the cash flows that are being poured into AI investments.\n\nI've got a few stocks that will be fine over the long term, regardless of what happens with tariffs. These are excellent stocks to scoop up now and should be purchased with the mindset of holding for three to five years.\n\nThe American flag.\nImage source: Getty Images.\nMeta Platforms\nMeta Platforms (NASDAQ: META) is an advertising company that earns most of its revenue (98%) from ads on social media platforms like Facebook and Instagram. It uses the enormous cash flows from its base business to heavily invest in AI, which allows it to innovate in the ad realm and develop new technologies.\n\nTariffs may hurt Meta's primary business by causing some economic headwinds, which could affect advertising revenue streams. However, that will only be an initial shock, and while it could be a bumpy year or two, Meta's base business will be just fine over the next three to five years.\n\n\nOver that time frame, there will undoubtedly be impressive AI developments, likely including Meta's AI glasses, which could become an important part of the Meta investment thesis if they become a hit. Regardless, I think there's a strong enough case for the base business to purchase Meta shares right now, no matter what happens with tariffs.\n\nMeta is also fairly priced. Although it would have been better to buy it a few weeks ago when the markets bottomed, it's still priced at the lower end of where it has traded over the past year.\n\nMETA PE Ratio Chart\nMETA PE Ratio data by YCharts\nEven though the market roared back, I think Meta still makes a compelling enough long-term investment to take a position in the stock now.\n\nNvidia\nNvidia (NASDAQ: NVDA) may be a surprise addition to this list, as it sources many of its chips from outside the country. However, Nvidia announced that its next-generation Blackwell GPUs will be produced entirely in the U.S. by 2026. With chips originating from Taiwan Semiconductor Manufacturing's Arizona facility and then assembled in Foxconn and Wistron plants in Texas, these GPUs won't be subject to tariffs, because they're domestically produced.\n\nNvidia's GPUs will still be in high demand over the next few years, as the AI hyperscalers are still working on building out their data center capacity. Furthermore, many GPUs originally purchased to train AI models will start to wear out, requiring Nvidia's customers to replace them. Third-party estimates pegged 2024 data center capital expenditures at $400 billion, but they're expected to rise to $1 trillion by 2028. This expansion will further bolster Nvidia's growth, making it a strong stock to buy (or at least continue holding).\n\nLike Meta's stock, Nvidia's dramatically recovered but is still below where it traded for most of 2024.\n\nNVDA PE Ratio (Forward) Chart\nNVDA PE Ratio (Forward) data by YCharts\nAt 31 times forward earnings, Nvidia isn't necessarily cheap, but the future looks bright enough for the company that it would be smart to scoop up shares now.\n\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $642,582!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $829,879!*\n\n\nNow, it’s worth noting Stock Advisor’s total average return is 975% — a market-crushing outperformance compared to 172% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join Stock Advisor.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of May 19, 2025\n\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Keithen Drury has positions in Meta Platforms, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool has positions in and recommends Meta Platforms, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy.\n\n2 Top Artificial Intelligence (AI) Stocks to Buy No Matter What Happens With Tariffs was originally published by The Motley Fool"
  },
  {
    "title": "Stablecoins stoke volatility in Brazil capital flows, says central banker",
    "abstract": "LONDON (Reuters) -The surge in popularity of U.S. dollar-backed stablecoins as a way of transferring money abroad is increasing the volatility of Brazilian capital flows, Brazil's central bank deputy governor said on Tuesday.\nBrazilians' crypto asset usage has surged over the past two to three years, with around 90% of the flow linked to stablecoins - digital money pegged to leading currencies like the U.S. dollar - its central bank estimates."
  },
  {
    "title": "Crypto scores a victory as stablecoin legislation stays alive in Senate",
    "abstract": "A bill to regulate stablecoins passed a key procedural hurdle in the Senate Monday night, paving a path for final passage of legislation pushed by the crypto industry as early as this week.\nThe bill still faces hurdles from some Democrats, including Sen. Elizabeth Warren, who argued against the proposed legislation on the floor of the Senate Monday night."
  }
]
